# 1)ახსენით რა არის Control Flow

# 2)ჩამოწერეთ და ახსენით ყველა Control Flowს ტექნიკა

# 3)ახსენით რა არის ალგორითმი

# 4)ახსენით რა არის ფსევდოკოდი

# 5)თქვენი სიტყვებით ახსენით For loop

# 6)ჩამოწერეთ რამდენი არგუმენტი შეიძლება გადაეცეს range()ფუნქცია და ახსენით რომელი რას აკეთებს

# 7)For ციკლის მეშვეობით ტერმინალში გამოიტანეთ თქვენი საყვარელი საჭმელი 15ჯერ

# 8)For ციკლის მეშვეობით ტერმინალში გამოიტანეთ ლუწი რიცხვები 1-1000ის ჩათვლით




#2) Sequencing Iteracion Selection ეს არის კონტროლ ფლოვს ყველა ტექნიკა

#3)მაგალითად აიღე num1 num2 შეიტანე რაიმე რიცხვი და შემდეგ შეკრიბე,გამოაკლე,გაამრავლე ად ა.შ

#4)ფსევდო კოდს ვიყენებთ გეგმისთვის და კომენთარებში ვწერთ

#5) for loop იმეორებს ერთი და იგივეს რამდენჯერმე









